app/views/question/show.html.erb

SELECT "variants".* FROM "variants" WHERE "variants"."question_id" = ?  [["question_id", 1]]
---
<br>
<%@question.variants.each do |v|%>

SELECT  "variants".* FROM "variants" WHERE "variants"."question_id" = ? AND "variants"."is_answer" = ? LIMIT ?  [["question_id", 1], ["is_answer", "t"], ["LIMIT", 1]]
---
<br>
ans: <%=@question.variants.where(is_answer:true).take.text%>